zecarlos1957/wxpic/Branches/NewDirectoryStructure/src/WinPicPr/PIC18F_PRG.cpp
// ------------------------------------------------------------------------------
// PIC programming routines for PIC18F devices
// ------------------------------------------------------------------------------
// Author : Martin van der Werff
// Date   : 19 may 2005  (last modified 2008-05-19 by WoBu)
// ------------------------------------------------------------------------------
// Copyright (C) 2005  Martin van der Werff
//
// This software is provided 'as-is', without any express or implied
// warranty.  In no event will the author be held liable for any damages
// arising from the use of this software.
//
// Permission to use, copy, modify, and distribute this software and its
// documentation for any purpose and without fee is hereby granted,
// provided that the above copyright notice and disclaimer appear in all
// copies and supporting documentation.
//
//
// ------------------------------------------------------------------------------
//
// Supported devices (PIC18FXX2/XX8)
//
//   PIC18F242   PIC18F248   PIC18F252   PIC18F258   PIC18F442   PIC18F448
//   PIC18F452   PIC18F458
//
// Supported devices (PIC18F2XX0/2XX5/4XX0/4XX5)
//
//   PIC18F2410  PIC18F4410  PIC18F2420  PIC18F4420  PIC18F2455  PIC18F4455
//   PIC18F2480  PIC18F4480  PIC18F2510  PIC18F4510  PIC18F2515  PIC18F4515
//   PIC18F2520  PIC18F4520  PIC18F2525  PIC18F4525  PIC18F2550  PIC18F4550
//   PIC18F2580  PIC18F4580  PIC18F2585  PIC18F4585  PIC18F2610  PIC18F4610
//   PIC18F2620  PIC18F4620  PIC18F2680  PIC18F4680
//
// These routines were tested using the JDM2 programmer on
//
//   PIC18LF2550 PIC18LF4550 PIC18LF4455 PIC18LF458
//
// ------------------------------------------------------------------------------

// Last modifications:
//  2006-02-28, WoBu: Modified PIC18F_SetDeviceFamily() (now three arguments)
//  2007-01-25, WoBu: Modified "Bulk Erase" in PIC18F_EraseChip_4550()
//          because Microchip seem to have changed the command patterns.
//          At least, a PIC18F4685 failed to erase with the OLD procedure.
//          (reported by Howard Cripe).
//  2008-05-19:  Minor changes for "intelligent" programmers ,
//          and for the planned "hardware interface plugin" (DLL) .
//  2010-01-02, PCh:  Ported to WxPic


#include <stdio.h>

#include "PIC_HW.h"
#include "PIC18F_PRG.h"
#include <Wx/Appl.h>

#define PIC18F_CORE_INSTRUCTION              0
#define PIC18F_SHIFT_OUT_TABLAT_REGISTER     2
#define PIC18F_TABLE_READ_POST_INCREMENT     9
#define PIC18F_TABLE_WRITE                   12
#define PIC18F_TABLE_WRITE_POST_INC_BY_2     13
#define PIC18F_TABLE_WRITE_START_PROGRAMMING 15

// void PIC_HW_Delay_50ns(void);    // now defined in PIC_HW.H ..
// void PIC_HW_Delay_500ns(void);

uint32_t dwStartOfOperation;
uint32_t dwChipFamily = PIC18_FAMILY_458;
uint32_t PIC18F_dwWriteBufferSize_words = 4;  /* .. WORDS ! */
uint32_t PIC18F_dwEraseBufferSize_words = 32; /* .. WORDS ! */
bool  PIC18F_fUseOldBulkEraseCommands= false; // flag for PIC18F_EraseChip_4550(), added 2007-01-25

void PIC18F_SetDeviceFamily(uint32_t dwFamily,           // PIC18_FAMILY_xxxx
             uint32_t dwWriteBufSize_wd,  // (*) size of the WRITE BUFFER in "words" (!)
             uint32_t dwEraseBufSize_wd)  // (*) size of the ERASE BUFFER in "words" (!)
  // (*) these parameters were added 2006-02-28 for more flexibility / new devices
{
  dwChipFamily = dwFamily;
  PIC18F_dwWriteBufferSize_words = dwWriteBufSize_wd;
  PIC18F_dwEraseBufferSize_words = dwEraseBufSize_wd;
}

void PIC18F_SendProgrammingCommand( uint16_t w4BitControlCode )
{
  PIC_HW_SetClockEnable( true );
  PIC_HW_SetDataEnable( true );

  for(int i = 0; i < 4; ++i)
  {
    PIC_HW_SetClockAndData(true, w4BitControlCode & 0x0001 );
    PIC_HW_Delay_50ns();
    PIC_HW_SetClockAndData(false,w4BitControlCode & 0x0001 );
    PIC_HW_Delay_50ns();
    w4BitControlCode >>= 1;
  }
}

void PIC18F_SendPayload( uint16_t wPayload )
{
  for( int i = 0; i < 16; ++i )
  {
    PIC_HW_SetClockAndData(true, wPayload & 1 );
    PIC_HW_Delay_50ns();
    PIC_HW_SetClockAndData(false,wPayload & 1 );
    PIC_HW_Delay_50ns();
    wPayload >>= 1;
  }
  if( PIC_HW_interface.type == PIC_INTF_TYPE_JDM2 )
  {
    PIC_HW_SetClockAndData(false, false);
  }
}

void PIC18F_SendProgrammingCommandWithPayload( uint16_t w4BitControlCode, uint16_t wPayload )
{
  PIC18F_SendProgrammingCommand( w4BitControlCode );
  PIC_HW_Delay_50ns();
  PIC18F_SendPayload( wPayload );
//  PicHw_FlushCommand( w4BitControlCode,4,  wPayload,16 ); // added 2008-05-19
}

void PIC18F_ExecuteCoreInstruction( uint16_t wInstruction )
{
  PIC18F_SendProgrammingCommandWithPayload(PIC18F_CORE_INSTRUCTION, wInstruction);
}

uint8_t PIC18F_ReadFromChip( uint16_t w4BitControlCode )
{
  uint8_t ucResult = 0;

  PIC_HW_SetClockEnable( true );
  PIC_HW_SetDataEnable( true );

  PIC18F_SendProgrammingCommand( w4BitControlCode );

  // Eight clock cycles are required to process the command
  for( int i = 0; i < 8; ++i )
  {
    PIC_HW_SetClockAndData(true,  PicHw_iStateOfDataOutWhileReading );
    PIC_HW_Delay_50ns();
    PIC_HW_SetClockAndData(false, PicHw_iStateOfDataOutWhileReading );
    PIC_HW_Delay_50ns();
  }
//  // Added 2008-05-19: Let "smart" interfaces know what we just sent :
//  PicHw_FlushCommand( w4BitControlCode,4,
//          ((PicHw_iStateOfDataOutWhileReading>0) ? 0x0FF : 0x00),16 );


  // In the next 8 clock cycles we receive the byte read from memory
  PIC_HW_SetDataEnable( false );
  for( int i = 0; i < 8; ++i )
  {
    PIC_HW_SetClockAndData( true, PicHw_iStateOfDataOutWhileReading);
    PIC_HW_Delay_50ns();
    ucResult |= PIC_HW_GetDataBit() << i;
    if(PIC_HW_interface.type==PIC_INTF_TYPE_JDM2)
    {
      PIC_HW_SetClockAndData( false, false );
    }
    else
    {
      PIC_HW_SetClockAndData( false, true  );
    }
    PIC_HW_Delay_50ns();
  }

  PIC_HW_SetDataEnable( true );
  if(PIC_HW_interface.type==PIC_INTF_TYPE_JDM2)
  {
    PIC_HW_SetClockAndData( false, false );
  }

  return ucResult;
}

