zecarlos1957/wxpic/Branches/NewDirectoryStructure/src/WinPicPr/PIC18F_PRG.cpp
void PIC18F_SendProgrammingNOP()
{
    // The programming duration is externally timed and is controlled by PGC.
    // After a Start Programming command is issued (4-bit command, ‘1111’), a
    // NOP is issued, where the 4th PGC is held high for the duration
    // of the programming time, P9 (= min 1 ms)
    for(int i = 0; i < 4; ++i)
    {
      PIC_HW_SetClockAndData(true,  false);
      if( i == 3 )
      { // 4th PGC
        PIC_HW_Delay_us( 1100 ); // keep PGC high for P9 (min 1 ms)
      }
      else
      { // PGC 1 - 3
        PIC_HW_Delay_50ns();
      }
      PIC_HW_SetClockAndData(false, false);
      PIC_HW_Delay_50ns();
    }
//    PicHw_FlushCommand( 0/*w4BitControlCode*/, 4/*bits*/,
//                                0/*wPayload*/, 0/*bits*/ ); // added 2008-05-19

    // After PGC is brought low, the programming sequence is terminated. PGC
    // must be held low for the time specified by parameter P10 (= min 100 us)
    // to allow high-voltage discharge of the memory array.
    PIC_HW_Delay_us( 120 );

    // Now send payload for NOP instruction
    PIC18F_SendPayload( 0x0000 );
//    PicHw_FlushCommand( 0/*w4BitControlCode*/, 0/*bits*/,
//                          0x0000/*wPayload*/, 16/*bits*/ ); // added 2008-05-19

}

void PIC18F_ConnectToTarget(const char * message)
{
#ifndef COMPILING_WINPIC
  fprintf(stderr, "%s\n", message);
#endif

  PIC_HW_ConnectToTarget();

  // Sometimes JDM2 fails to bring the pic into programming mode.
  // This redundant sequence seems to solve the problem.
  PIC_HW_ProgMode();
  PIC_HW_ProgModeOff();

  PIC_HW_ProgMode();

  dwStartOfOperation = GetTickCount();
}

void PIC18F_DisconnectFromTarget(const char * message)
{

#ifndef COMPILING_WINPIC
  uint32_t dwEndOfOperation = GetTickCount();
  fprintf(stderr, "%s (took %.3f sec)\n", message, (dwEndOfOperation - dwStartOfOperation) / 1000.0);
#endif

  PIC_HW_ProgModeOff();
}

void PIC18F_SetTablePointer(uint32_t dwTablePointer)
{
  uint16_t TBLPTRU = (dwTablePointer >> 16) & 0xff;
  uint16_t TBLPTRH = (dwTablePointer >> 8) & 0xff;
  uint16_t TBLPTRL = dwTablePointer & 0xff;
  // Set Table Pointer register
  PIC18F_ExecuteCoreInstruction( 0x0e00 | TBLPTRU ); // MOVLW Addr[21:16]
  PIC18F_ExecuteCoreInstruction( 0x6ef8 );           // MOVWF TBLPTRU
  PIC18F_ExecuteCoreInstruction( 0x0e00 | TBLPTRH ); // MOVLW <Addr[15:8]>
  PIC18F_ExecuteCoreInstruction( 0x6ef7 );           // MOVWF TBLPTRH
  PIC18F_ExecuteCoreInstruction( 0x0e00 | TBLPTRL ); // MOVLW <Addr[7:0]>
  PIC18F_ExecuteCoreInstruction( 0x6ef6 );           // MOVWF TBLPTRL
}

void PIC18F_SetEEPROMAddress(uint32_t dwEEADR)
{
  uint16_t EEADRH = (dwEEADR >> 8) & 0xff;
  uint16_t EEADR  = dwEEADR & 0xff;
  // Set Table Pointer register
  PIC18F_ExecuteCoreInstruction( 0x0e00 | EEADR );   // MOVLW <Addr[7:0]>
  PIC18F_ExecuteCoreInstruction( 0x6ea9 );           // MOVWF EEADR
  PIC18F_ExecuteCoreInstruction( 0x0e00 | EEADRH );  // MOVLW <Addr[15:8]>
  PIC18F_ExecuteCoreInstruction( 0x6eaa );           // MOVWF EEADRH
}

uint32_t PIC18F_ReadDeviceID()
{
  PIC18F_ConnectToTarget("Start reading 18F device for DeviceID");

  // Set Table Pointer register to 0x3ffffe (here we find DEVID1)
  PIC18F_SetTablePointer(0x3ffffe);

  uint8_t devID1 = PIC18F_ReadFromChip(PIC18F_TABLE_READ_POST_INCREMENT);

  // at 0x3fffff we find DEVID2
  uint8_t devID2 = PIC18F_ReadFromChip(PIC18F_TABLE_READ_POST_INCREMENT);

  PIC18F_DisconnectFromTarget("Done reading 18F device for DeviceID");

  // The PIC18LF2550 rev A3 reads out as DEVID1 = 42 and DEVID2 = 12

  // return "DEVID2" in bits 15..8 and "DEVID1" in bits 7..0
  return ((uint16_t)devID2) << 8 | devID1;
}

bool PIC18F_ReadCodeMemory(
  uint32_t dwAddress,
  uint32_t *pdwDestBuffer,
  uint32_t dwNumberOfCodeWords
)
{
  bool fResult = true; // returns true if not interrupted, or other error

  PIC18F_ConnectToTarget("Start reading code memory 18F device");

  // Set Table Pointer register to dwAddress (convert to bytes)
  PIC18F_SetTablePointer(dwAddress);

  for( uint32_t i = 0; i < dwNumberOfCodeWords; ++i )
  {
    uint32_t evenByte = (uint32_t) PIC18F_ReadFromChip(PIC18F_TABLE_READ_POST_INCREMENT);
    uint32_t oddByte  = (uint32_t) PIC18F_ReadFromChip(PIC18F_TABLE_READ_POST_INCREMENT);
    pdwDestBuffer[i] =  (oddByte << 8) | evenByte;

    APPL_ShowProgress( 100 * i / dwNumberOfCodeWords );
    if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
    {
      fResult = false;
      break;
    }
  }

  PIC18F_DisconnectFromTarget("Done reading code memory 18F device");

  return fResult;
}

bool PIC18F_WriteCodeMemory(
  uint32_t dwAddress,
  uint32_t *pdwSourceData,
  uint32_t dwNumberOfCodeWords
)
{
  uint32_t dwChipWriteBufferSize = 16; // write-buffer-size in WORDS (not BYTES)
  bool fResult = true; // returns true if not interrupted, or other error

  PIC18F_ConnectToTarget("Start writing code memory 18F device");

  // Programming code memory is accomplished by first loading data into
  // the write buffer and then initiating a programming sequence.
  //
  // The size of the write buffer differs between devices
  //
  //  8 bytes  PIC18F2410, PIC18F2510, PIC18F4410, PIC18F4510
  //           PIC18F2420, PIC18F2520, PIC18F4420, PIC18F4520
  //           PIC18F2480, PIC18F2580, PIC18F4480, PIC18F4580
  //
  // 32 bytes  PIC18F2455, PIC18F2550, PIC18F4455, PIC18F4550
  //
  // 64 bytes  PIC18F2515, PIC18F2610, PIC18F4515, PIC18F4610
  //           PIC18F2525, PIC18F2620, PIC18F4585, PIC18F4280
  //           PIC18F2585, PIC18F2680, PIC18F4585, PIC18F4680
  //
  // The 458 family of devices have an 8 byte buffer for each panel (=8K flash)
  // Since 2006-02-28, the WRITE- and ERASE-"buffer"-size is defined in the
  // device definition file, and passed as an argument to
  // ONLY IF THAT INFORMATION IS OBVIOUSLY MISSING, we set it here:
  if( PIC18F_dwWriteBufferSize_words > 0 )
   { dwChipWriteBufferSize = PIC18F_dwWriteBufferSize_words;
   }
  else  // must GUESS the write-buffer-size :
   { switch(dwChipFamily)  // (the "old" way, before 2006-02-28)
      {
        case PIC18_FAMILY_458  : dwChipWriteBufferSize =  4; break;
        case PIC18_FAMILY_4580 : dwChipWriteBufferSize =  4; break;
        case PIC18_FAMILY_4550 : dwChipWriteBufferSize = 16; break;
        case PIC18_FAMILY_4680 : dwChipWriteBufferSize = 32; break;
        default: return false;
      }
   }

  // Disable the Multi-Panel Write mode for the 458 family of devices. This is
  // slower, but allows us to use PIC18F_WriteCodeMemory for code memory, id
  // locations and the boot block. Writing the full code memory (32K) of the
  // 18f458 takes now 7.8 seconds. This could be reduced to about 2.5 seconds
  // by using the Multi-Panel Write mode.
  if( dwChipFamily == PIC18_FAMILY_458 )
  {
    // Enable writes and direct access to config memory
    PIC18F_ExecuteCoreInstruction(0x8ea6); // BSF EECON1, EEPGD
    PIC18F_ExecuteCoreInstruction(0x8ca6); // BSF EECON1, CFGS
    // Write 00h to 3C0006h to enable single panel writes
    PIC18F_ExecuteCoreInstruction(0x0e3c); // MOVLW 3Ch
    PIC18F_ExecuteCoreInstruction(0x6ef8); // MOVWF TBLPTRU
    PIC18F_ExecuteCoreInstruction(0x0e00); // MOVLW 00h
    PIC18F_ExecuteCoreInstruction(0x6ef7); // MOVWF TBLPTRH
    PIC18F_ExecuteCoreInstruction(0x0e06); // MOVLW 06h
    PIC18F_ExecuteCoreInstruction(0x6ef6); // MOVWF TBLPTRL
    PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE, 0x0000); // Write 00h to 3C0006h
  }

  uint32_t dwNumberOfCodeWordsLeft = dwNumberOfCodeWords;
  uint32_t dwCodeWordPtr = 0;
  do
  {
    // Direct access to code memory and enable writes
    PIC18F_ExecuteCoreInstruction(0x8ea6); // BSF EECON1, EEPGD
    PIC18F_ExecuteCoreInstruction(0x9ca6); // BCF EECON1, CFGS

    // Set Table Pointer register to dwAddress
    PIC18F_SetTablePointer(dwAddress + (dwCodeWordPtr << 1));

