zecarlos1957/wxpic/Branches/NewDirectoryStructure/src/WinPicPr/PIC18F_PRG.cpp
    uint32_t dwNumWordsToWrite = dwNumberOfCodeWordsLeft;
    if( dwNumWordsToWrite > dwChipWriteBufferSize )
      dwNumWordsToWrite = dwChipWriteBufferSize;

    for(uint32_t i = 0; i < dwNumWordsToWrite; ++i)
    {
      uint16_t word = (uint16_t)pdwSourceData[dwCodeWordPtr + i];
      PIC18F_SendProgrammingCommandWithPayload( (i == (dwNumWordsToWrite-1)) ?
        PIC18F_TABLE_WRITE_START_PROGRAMMING : PIC18F_TABLE_WRITE_POST_INC_BY_2,
        word);
    }

    PIC18F_SendProgrammingNOP();

    dwNumberOfCodeWordsLeft -= dwNumWordsToWrite;
    dwCodeWordPtr += dwNumWordsToWrite;

    APPL_ShowProgress( 100 * (dwNumberOfCodeWords - dwNumberOfCodeWordsLeft) / dwNumberOfCodeWords );
    if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
    {
      fResult = false;
      break;
    }
  }
  while( dwNumberOfCodeWordsLeft > 0 );

  PIC18F_DisconnectFromTarget("Done writing code memory 18F device");

  return fResult;
}

bool PIC18F_EraseChip_458 (void)
{
  PIC18F_ConnectToTarget("Start erasing 18F device (458 family)");

  // Erasing code or data EEPROM is accomplished by writing an “erase option”
  // to address 3C0004h. Code memory may be erased portions at a time, or the
  // user may erase the entire device in one action. “Bulk Erase” operations
  // will also clear any code protect settings associated with the memory block
  // erased.
  //
  // Chip Erase          80h
  // Erase Data EEPROM   81h
  // Erase Boot Block    83h
  // Erase Panel 1       88h
  // Erase Panel 2       89h
  // Erase Panel 3       8Ah
  // Erase Panel 4       8Bh

  // Write 80h to 3C0004h to to erase entire device
  PIC18F_ExecuteCoreInstruction(0x0e3c); // MOVLW 3Ch
  PIC18F_ExecuteCoreInstruction(0x6ef8); // MOVWF TBLPTRU
  PIC18F_ExecuteCoreInstruction(0x0e00); // MOVLW 00h
  PIC18F_ExecuteCoreInstruction(0x6ef7); // MOVWF TBLPTRH
  PIC18F_ExecuteCoreInstruction(0x0e04); // MOVLW 04h
  PIC18F_ExecuteCoreInstruction(0x6ef6); // MOVWF TBLPTRL
  PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE, 0x0080); // Write 80h TO 3C0004h
  PIC18F_ExecuteCoreInstruction(0x0000); // NOP

  PIC18F_SendProgrammingCommand(0);

  // The actual Bulk Erase function is a self-timed operation. Once the erase
  // has started (falling edge of the 4th SCLK after the WRITE command), serial
  // execution will cease until the erase completes (P11 = min 5 ms). During
  // this time, SCLK may continue to toggle, but SDATA must be held low.

  // keep SDATA low for P11
  PIC_HW_Delay_us( 5500 );

  PIC18F_DisconnectFromTarget("Done erasing 18F device (458 family)");

  return true;
}

bool PIC18F_EraseChip_4550 (void)
{
  PIC18F_ConnectToTarget("Start erasing 18F device (4550 family)");

  // Erasing code or data EEPROM is accomplished by configuring two Bulk
  // Erase Control registers located at 3C0004h and 3C0005h. Code memory may
  // be erased portions at a time, or the user may erase the entire device in
  // one action. Bulk Erase operations will also clear any code-protect
  // settings associated with the memory block erased.
  //
  // Chip Erase                  0F87h (*)
  // Erase Data EEPROM           0084h
  // Erase Boot Block            0081h
  // Erase Config Bits           0082h
  // Erase Code EEPROM Block 0   0180h
  // Erase Code EEPROM Block 1   0280h
  // Erase Code EEPROM Block 2   0480h
  // Erase Code EEPROM Block 3   0880h
  //
  // (*) Note on Chip Erase: One fine day, Microchip changed
  //     the chip erase pattern from 0x0F0F 0x8787 to 0x3F3F 0x8F8F
  //     ... at least document DS39622J says on page 14 .
  //  The question is, will OLDER chips which *did* work with the
  //  original code (based on DS39622B) still work with the NEWER algorithm ?
  //  To avoid trouble with this right from the start, the flag
  //  'PIC18F_fUseOldBulkEraseCommands' was added by WoBu (2007-01-25) .

  // Write 0F87h (*) to 3C0004/5 to to erase entire device
  PIC18F_ExecuteCoreInstruction(0x0e3c); // MOVLW 3Ch
  PIC18F_ExecuteCoreInstruction(0x6ef8); // MOVWF TBLPTRU
  PIC18F_ExecuteCoreInstruction(0x0e00); // MOVLW 00h
  PIC18F_ExecuteCoreInstruction(0x6ef7); // MOVWF TBLPTRH
  PIC18F_ExecuteCoreInstruction(0x0e05); // MOVLW 05h
  PIC18F_ExecuteCoreInstruction(0x6ef6); // MOVWF TBLPTRL
  if( PIC18F_fUseOldBulkEraseCommands )
   {  // This is the OLD code, which worked ok until Microchip changed something somewhere :o(
      PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE, 0x0f0f); // Write 0Fh to 3C0005h
   }
  else  // command pattern for "Bulk Erase" changed by Microchip ?! ?! ?!
   {  PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE, 0x3f3f); // Write 3Fh to 3C0005h
   }
  PIC18F_ExecuteCoreInstruction(0x0e3c); // MOVLW 3Ch
  PIC18F_ExecuteCoreInstruction(0x6ef8); // MOVWF TBLPTRU
  PIC18F_ExecuteCoreInstruction(0x0e00); // MOVLW 00h
  PIC18F_ExecuteCoreInstruction(0x6ef7); // MOVWF TBLPTRH
  PIC18F_ExecuteCoreInstruction(0x0e04); // MOVLW 04h
  PIC18F_ExecuteCoreInstruction(0x6ef6); // MOVWF TBLPTRL
  if( PIC18F_fUseOldBulkEraseCommands )
   {  // This is the OLD code, which worked ok until Microchip changed something somewhere :o(
      // DS39622B (yet another "Flash Memory Programming Specification") wanted it this way:
      PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE, 0x8787); // Write 87h TO 3C0004h
   }
  else // new command pattern for "Bulk Erase" changed by Microchip ?! ?! ?!
   {   // DS39622J (= newer "Flash Memory Programming Specification") wants this:
      PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE, 0x8F8F); // Write 8Fh TO 3C0004h
   }

  PIC18F_ExecuteCoreInstruction(0x0000); // NOP

  PIC18F_SendProgrammingCommand(0);

  // The actual Bulk Erase function is a self-timed operation. Once the erase
  // has started (falling edge of the 4th PGC after the NOP command), serial
  // execution will cease until the erase completes (P11 = min 5 ms).
  // During this time, PGC may continue to toggle but PGD must be held low.

  // PGC must further be held low for the time specified by parameter P10
  // (= min 100 us) to allow high-voltage discharge of the memory array.
  // [this is not in the text but it is in the bulk erase timing figure (3-2)]

