zecarlos1957/wxpic/Branches/NewDirectoryStructure/src/WinPicPr/PIC18F_PRG.cpp
  // keep PGD low for P11 + P10 (5 ms + 100us)
  PIC_HW_Delay_us( 5500 );

  PIC18F_DisconnectFromTarget("Done erasing 18F device (4550 family)");

  return true;
}

bool PIC18F_EraseChip (void)
{
  switch(dwChipFamily)
  {
    case PIC18_FAMILY_458  : return PIC18F_EraseChip_458();
    case PIC18_FAMILY_4580 :
    case PIC18_FAMILY_4550 :
    case PIC18_FAMILY_4680 : return PIC18F_EraseChip_4550();
    default: return false;
  }
}

bool PIC18F_ReadDataMemory(
  uint32_t dwAddress,
  uint32_t *pdwDestBuffer,
  uint32_t dwNumberOfBytes
)
{
  bool fResult = true; // returns true if not interrupted, or other error

  PIC18F_ConnectToTarget("Start reading data memory 18F device");

  // Data EEPROM is accessed one byte at a time via an address pointer
  // (register pair EEADRH:EEADR) and a data latch (EEDATA). Data EEPROM is
  // read by loading EEADRH:EEADR with the desired memory location and
  // initiating a memory read by appropriately configuring the EECON1 register.
  // The data will be loaded into EEDATA, where it may be serially output on
  // PGD via the 4-bit command, ‘0010’.

  // Step 1: Direct access to data EEPROM

  PIC18F_ExecuteCoreInstruction(0x9ea6); // BCF EECON1, EEPGD
  PIC18F_ExecuteCoreInstruction(0x9ca6); // BCF EECON1, CFGS

  for( uint32_t i = 0; i < dwNumberOfBytes; ++i )
  {
    // Step 2: Set the data EEPROM address pointer

    PIC18F_SetEEPROMAddress(dwAddress + i);

    // Step 3: Initiate a memory read

    PIC18F_ExecuteCoreInstruction(0x80a6); // BSF EECON1, RD

    // Step 4: Load data into the Serial Data Holding register

    PIC18F_ExecuteCoreInstruction( 0x50a8 ); // MOVF EEDATA, W, 0
    PIC18F_ExecuteCoreInstruction( 0x6ef5 ); // MOVWF TABLAT
    PIC18F_ExecuteCoreInstruction( 0x0000 ); // NOP
    pdwDestBuffer[i] = PIC18F_ReadFromChip(PIC18F_SHIFT_OUT_TABLAT_REGISTER);

    APPL_ShowProgress( 100 * i / dwNumberOfBytes );
    if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
    {
      fResult = false;
      break;
    }
  }

  PIC18F_DisconnectFromTarget("Done reading data memory 18F device");

  return fResult;
}

bool PIC18F_WriteDataMemory(
  uint32_t dwAddress,       // address in bytes
  uint32_t *pdwDestBuffer,  // only lower 8 bit in each uint32_t used here
  uint32_t dwNumberOfBytes  // for EEPROM, count of bytes(!) to be read
)
{
  bool fResult = true; // returns true if not interrupted, or other error

  PIC18F_ConnectToTarget("Start writing data memory 18F device");

  // Data EEPROM is accessed one byte at a time via an address pointer
  // (register pair EEADRH:EEADR) and a data latch (EEDATA). Data EEPROM is
  // written by loading EEADRH:EEADR with the desired memory location, EEDATA
  // with the data to be written and initiating a memory write by appropriately
  // configuring the EECON1 register. A byte write automatically erases the
  // location and writes the new data (erase-before-write).

  // Step 1: Direct access to data EEPROM
  //
  //   When using the EECON1 register to perform a data EEPROM write, both the
  //   EEPGD and CFGS bits must be cleared (EECON1<7:6> = 00).

  PIC18F_ExecuteCoreInstruction(0x9ea6); // BCF EECON1, EEPGD
  PIC18F_ExecuteCoreInstruction(0x9ca6); // BCF EECON1, CFGS

  for(uint32_t i = 0; i < dwNumberOfBytes; ++i)
  {
    // Step 2: Set the data EEPROM address pointer

    PIC18F_SetEEPROMAddress(dwAddress + i);

    // Step 3: Load the data to be written

    uint16_t EEDATA = (uint16_t)pdwDestBuffer[i];
    PIC18F_ExecuteCoreInstruction( 0x0e00 | EEDATA ); // MOVLW <Data>
    PIC18F_ExecuteCoreInstruction( 0x6ea8 );          // MOVWF EEDATA

    // Step 4: Enable memory writes.
    //
    //   The WREN bit must be set (EECON1<2> = 1) to enable writes of any sort
    //   and this must be done prior to initiating a write sequence.

    PIC18F_ExecuteCoreInstruction( 0x84a6 ); // BSF EECON1, WREN

    if( dwChipFamily == PIC18_FAMILY_458 )
    {
      // To help prevent inadvertent writes when using the EECON1 register,
      // EECON2 is used to “enable” the WR bit. This register must be
      // sequentially loaded with 55h and then, AAh, immediately prior to
      // asserting the WR bit in order for the write to occur.

      PIC18F_ExecuteCoreInstruction( 0x0e55 ); // MOVLW 0x55
      PIC18F_ExecuteCoreInstruction( 0x6ea7 ); // MOVWF EECON2
      PIC18F_ExecuteCoreInstruction( 0x0eaa ); // MOVLW 0xAA
      PIC18F_ExecuteCoreInstruction( 0x6ea7 ); // MOVWF EECON2
    }

    // Step 5: Initiate write.
    //
    //   The write sequence is initiated by setting the WR bit (EECON1<1> = 1).
    //   The write begins on the falling edge of the 4th PGC after the WR bit is
    //   set.

    PIC18F_ExecuteCoreInstruction( 0x82a6); // BSF EECON1, WR

    // Step 6: Poll WR bit, repeat until the bit is clear
    //
    //   It ends when the WR bit is cleared by hardware.

    uint8_t wr;
    int count = 0;
    do
    {
      PIC18F_ExecuteCoreInstruction( 0x50a6 ); // MOVF EECON1, W, 0
      PIC18F_ExecuteCoreInstruction( 0x6ef5 ); // MOVWF TABLAT
      PIC18F_ExecuteCoreInstruction( 0x0000 ); // NOP
      wr = PIC18F_ReadFromChip(PIC18F_SHIFT_OUT_TABLAT_REGISTER);
      ++count;
      if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
      {
        fResult = false;
        break;
      }
    }
    while( ((wr & 0x02) == 0x02) && (count < 100) );

    // Step 7: Hold PGC low for time P10
    //
    //   After the programming sequence terminates, PGC must still be held low for
    //   the time specified by parameter P10 (= min 100 us) to allow high-voltage
    //   discharge of the memory array.

    PIC_HW_Delay_us( 110 );

    // Step 8: Disable writes

    PIC18F_ExecuteCoreInstruction( 0x94a6 ); // BCF EECON1, WREN

    APPL_ShowProgress( 100 * i / dwNumberOfBytes );
    if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
    {
      fResult = false;
      break;
    }
  }
  PIC18F_DisconnectFromTarget("Done writing data memory 18F device");

  return fResult;
}

bool PIC18F_ReadConfigRegs(uint32_t dwSourceAddress, uint32_t *pdwDestBuffer, uint32_t dwNrOfRegisters)
{
  // The code memory reading algorithm will work to read any memory in the
  // 000000h to 3FFFFFh address space, so it also applies to the reading of
  // the ID and Configuration registers

  return PIC18F_ReadCodeMemory(dwSourceAddress, pdwDestBuffer, dwNrOfRegisters);
}

