zecarlos1957/wxpic/Branches/NewDirectoryStructure/src/WinPicPr/PIC18F_PRG.cpp
bool PIC18F_WriteConfigRegs(uint32_t dwDestAddress, uint32_t *pdwSourceData, uint32_t dwNrOfRegisters)
{
  PIC18F_ConnectToTarget("Start writing configuration words 18F device");

  // Note: Enabling the write protection of configuration bits (WRTC = 0 in
  //       CONFIG6H) will prevent further writing of configuration bits. Always
  //       write all the configuration bits before enabling the write protection
  //       for configuration bits.
  // Note 2 (by Wolf; nothing changed, just for clarity) :
  //       Though Microchip treats the PIC18F's config memory like an
  ///      array of BYTES, we treat them as 16-BIT-"WORD"-registers here.
  //       For example, a PIC18F252 has SEVEN CONFIG REGISTERS (plus one unused dummy
  //       at address 0x300000) so dwNrOfRegisters will usually be '8' here
  //        for the following registers:
  //       CONFIG0L,CONFIG0H,  CONFIG1L,CONFIG1H, ...  , CONFIG7L,CONFIG7H.
  //
  for(uint32_t ptr = 0; ptr < dwNrOfRegisters; ++ptr)
  {
    // Enable writes and direct access to config memory
    PIC18F_ExecuteCoreInstruction(0x8ea6); // BSF EECON1, EEPGD
    PIC18F_ExecuteCoreInstruction(0x8ca6); // BSF EECON1, CFGS

    // Set Table Pointer register to configuration word
    uint32_t dwTablePointer = (dwDestAddress & 0xfffffffe) + (ptr << 1);
    PIC18F_SetTablePointer( dwTablePointer );

    uint16_t word = (uint16_t)pdwSourceData[ptr];

    PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE_START_PROGRAMMING, word);
    PIC18F_SendProgrammingNOP();

    uint16_t TBLPTRL = ++dwTablePointer & 0xff;
    PIC18F_ExecuteCoreInstruction( 0x0e00 | TBLPTRL ); // MOVLW <Addr[7:0]>
    PIC18F_ExecuteCoreInstruction( 0x6ef6 );           // MOVWF TBLPTRL

    PIC18F_SendProgrammingCommandWithPayload(PIC18F_TABLE_WRITE_START_PROGRAMMING, word);
    PIC18F_SendProgrammingNOP();
  }

  PIC18F_DisconnectFromTarget("Done writing configuration words 18F device");

  return true;
}

